# Задайте список. Напишите программу, которая 
# определит, присутствует ли в заданном списке 
# строк некое число.
# ['gfh5', 'gfh2', '67', 'jy32', '3put'] - ищем 32 
# - находим по индексу 3

new_list = ['gfh5', 'gfh2', '67', 'jy32', '3put']
number = "32"
for i in range(0, len(new_list)): 
   a = new_list[i].find(number)
   if a != -1:
        print(i)